read_verilog phy_rx.v
hierarchy -check -top phy_rx

proc; opt; fsm; opt; memory; opt; techmap; opt;

dfflibmap -liberty ./CMOS/cmos_cells.lib

abc -liberty ./CMOS/cmos_cells.lib

clean

#show -notitle -format pdf -prefix modulo_diagramCMOS -lib ./CMOS/cmos_cells.v

write_verilog -noattr phy_rxSynth.v
